# Must Knows in Pandas
- View Dataframe
- Rename Columns
- Drop Column
- Filtering
- Add Column
- Fill Nulls
- Aggregation
- Standard Transformations
- Keep it in the JVM
- Row Conditional Statements
- Python when Required
- merge/join dataframes
- Pivot table
- Summary Statistics
- histogram
- SQL

In [37]:
import pandas as pd
import numpy as np

In [38]:
staff_df=pd.DataFrame([{'Name': 'Kelly', 'Role': 'Directory of HR'},
                        {'Name': 'sally', 'Role': 'course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df=staff_df.set_index('Name')
staff_df

                  Role
Name
Kelly  Directory of HR
sally   course liasion
James           Grader

### In Real life most people use following line to load data 
df = pd.read_csv('census.csv') \
df

### View dataframe

In [39]:
staff_df
df=staff_df

In [40]:
df.head(2)

                  Role
Name
Kelly  Directory of HR
sally   course liasion

In [41]:
df.columns

Index(['Role'], dtype='object')

In [42]:
df.dtypes

Role    object
dtype: object

### create new columns

In [43]:
df['copy_of_role']=df['Role']
df

                  Role     copy_of_role
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

### rename columns

In [44]:
df.columns=['role1','role2']
df

                 role1            role2
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

In [45]:
df.rename(columns={'role2':'new_role'})
df

                 role1            role2
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

### why it does not work????

In [46]:
df.rename(columns={'role2':'new_role'}, inplace=True)
df

                 role1         new_role
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

### drop columns

In [47]:
df.drop(['new_role'],axis=1, inplace=True)

### Filtering by rows and columns

In [48]:
# df[df.Name=='kelly']
df.loc[['Kelly', 'sally']]

                 role1
Name
Kelly  Directory of HR
sally   course liasion

### Convert list  to dataframe and vice versa

In [2]:
y_test=y_test['col'].to_list()
pd.DataFrame(ylist)

### .loc and .iloc are looking for a tuple as inputs
so you will need to provide a list, which could be a string, or numbers

In [49]:
# df[df.Name=='kelly']
df.iloc[[0,2]]

                 role1
Name
Kelly  Directory of HR
James           Grader

In [ ]:
df.iloc[5:15,2:7]

### Add Columns

In [50]:
df['dummy']=[1,2,3]
df

                 role1  dummy
Name
Kelly  Directory of HR      1
sally   course liasion      2
James           Grader      3

### Filtering by values

In [51]:
df[(df.dummy<=2)|(df.index=='James')]

                 role1  dummy
Name
Kelly  Directory of HR      1
sally   course liasion      2
James           Grader      3

### filter out columns to get results

In [51]:
df[(df.cost.notnull())].loc[:,['cost','price','purchase_date']]

                 role1  dummy
Name
Kelly  Directory of HR      1
sally   course liasion      2
James           Grader      3

### Assign Value to a filtered cell, notice how to use loc[cond and feature] to work
***x.loc[cond, feature]=value***

In [ ]:
X.loc[(X['market_id']==i)&(X[feature].isnull()),feature] = X.loc[X['market_id']==i,feature].mode()[0]

### Zip Feature importances to Feaure names

In [2]:
importances = list(zip(clf.feature_importances_, X_train2.columns))
importances.sort(reverse=True)

### Sort by one column

In [52]:

final_df=df.sort_values(by=['dummy'], ascending=False)
final_df

                 role1  dummy
Name
James           Grader      3
sally   course liasion      2
Kelly  Directory of HR      1

### Warning:pandas is picky, you have to use (cond1)|(cond2)&(cond3)!

### Logical Operators
in Pandas are &, | and ~, and parentheses (...) is important!

### Some time we need to drop some columns

### To use NaN, we need to call np.nan

In [67]:
df_demo = pd.DataFrame(df.dummy.replace(1, np.nan))
df_demo

       dummy
Name
Kelly    NaN
sally    2.0
James    3.0

In [68]:
df_demo.isna()

       dummy
Name
Kelly   True
sally  False
James  False

In [ ]:
demo1= df_demo.dropna(axis='index', how='all', subset)
df_demo

In [70]:
df_demo.dropna(axis='index', how='all', inplace=True)
df_demo

       dummy
Name
sally    2.0
James    3.0

### FILL NULLS

In [ ]:
df.fillna(0)

### Aggregation
let's create another dataframe

In [ ]:
staff_df['dummy1']=[2,3,4]
df=staff_df

### simple way for aggregation

In [ ]:
df.groupby(['role1']).agg(['min','max','count'])
# remember to use [] to call agg function

In [ ]:
df.agg?

### Little complication

In [ ]:
df.groupby(['role1']).agg({'dummy':['min','max'],'dummy1':['count']})
# df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})

### Row Condition statements

In [ ]:
df['New']=df['dummy1'].apply(lambda x: 1 if x>2 else 2 if x<1 else 3)

In [ ]:
df

# SECTION2

### Concat, Join and Merge

In [ ]:
student_df=pd.DataFrame([{'Name': 'James', 'school': 'buisness'},
                        {'Name': 'sally', 'school': 'law'},
                         {'Name': 'Mike', 'school': 'engineering'}])
student_df=student_df.set_index('Name')
student_df

In [ ]:
staff_df=pd.DataFrame([{'Name': 'Kelly', 'Role': 'Directory of HR'},
                        {'Name': 'sally', 'Role': 'course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df=staff_df.set_index('Name')
staff_df

### Concatenate dataframes, note axis and []

In [ ]:
# df.join?
new_df=pd.concat([student_df, staff_df], axis=1)
new_df

### Join tables (dataframess) using df1.join(df2)

In [ ]:
staff_df.join(student_df, how='outer',sort='Name')
# df.join(other, lsuffix='_caller', rsuffix='_other')

In [ ]:
staff_df.join(student_df, how='inner')
# df.join(other, lsuffix='_caller', rsuffix='_other')

In [ ]:
staff_df.join(student_df, how='left')
# df.join(other, lsuffix='_caller', rsuffix='_other')

In [ ]:
staff_df.join(student_df, how='right')
# df.join(other, lsuffix='_caller', rsuffix='_other')

### Merge tables (dataframess) using df1.merge(df2)
More flexible and versatile way of join tables

In [ ]:
df.merge?
# df1.merge(df2, left_on='lkey', right_on='rkey')
# f.merge(
#     right,
#     how='inner',
#     on=None,
#     left_on=None,
#     right_on=None,
#     left_index=False,
#     right_index=False,
#     sort=False,
#     suffixes=('_x', '_y'),
#     copy=True,
#     indicator=False,
#     validate=None,
# ) -> 'DataFrame'

In [ ]:
new_df=staff_df.merge(student_df, how='outer',left_index=True, right_index=True)
new_df

### such as left.merge(right, left_on='a', right_on='b')

### PIVOT and PIVOT Table in Pandas

~~~
pd.pivot_table(df, values='D' 
              index=['a','b'], 
               columns=['c'], 
               aggfimc=np.sum)
~~~

### Let's prepare a classic dataframe using sklearn package in python

In [ ]:
from sklearn.datasets import load_iris
X, y = load_iris(return_X_y=True)
df1=pd.DataFrame(X)
df2=pd.DataFrame(y)

In [ ]:
df1.columns=['sepal_length','sepal_width','petal_length','petal_width']
df2.columns=['species']
df=df1.join(df2)
df['species_name']=df.species.apply( lambda x : 'setosa' if x==0 else 'versicolor'if x==1 else 'virginica' )
df

In [ ]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                            'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

In [ ]:
df.pivot(index='bar',columns='foo', values='zoo')

In [ ]:
df = pd.DataFrame({
        "lev1": [1, 1, 1, 2, 2, 2],
        "lev2": [1, 1, 2, 1, 1, 2],
        "lev3": [1, 2, 1, 2, 1, 2],
        "lev4": [1, 2, 3, 4, 5, 6],
        "values": [0, 1, 2, 3, 4, 5]})
df

In [ ]:
df.pivot(index="lev1", columns=["lev2", "lev3"],values="values")
df.pivot(index=["lev2", "lev3"], columns="lev1", values="lev2")
# df.pivot(index="lev2", columns="lev1", values="lev3")

https://www.youtube.com/watch?v=xPPs59pn6qU
aggfunc numpy function
https://github.com/codebasics/py/blob/master/pandas/10_pivot/pandas_pivot.ipynb

### Pivot Table

In [ ]:
new_df=pd.pivot_table(df, 
                     index="lev2",
                      columns="lev1",
                     ) #take average of the lev3, lev4
new_df

In [ ]:
new_df=pd.pivot_table(df, 
                     index="lev2",
                      columns="lev1",
                      values='lev3') # take the average of lev3
new_df

### Margins

In [ ]:
new_df=pd.pivot_table(df, 
                     index="lev2",
                      columns="lev1",
#                       values='lev3',
                      margins=True,
                      aggfunc=np.sum
                     ) # take the numpy functions
new_df

### group by
as in SQL

In [ ]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                            'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

In [ ]:
new_df=pd.pivot_table(df, 
                     index="foo",
                      columns="bar",
                      values='baz',
                      aggfunc=np.max
                     ) # take the numpy functions
new_df

In [ ]:
df

In [ ]:
df.groupby(df['foo']).agg(np.mean)

### Create dataframe from array from scratch

In [ ]:
arr= np.ones(54778).reshape(54778,1)
dummy=pd.DataFrame({'actual_delivery_time': arr[:,0]})

pred_features=pd.concat([pred_features,dummy], axis=1)
pred_features.shape

reample by week and Aggregation by count and sum

In [ ]:
edf2 = e2.resample('W').agg({"Category":'size',"Sales":'sum'})

### Detect and remove Duplicated data from dataframe

In [ ]:
df_W1.duplicated().any()

In [ ]:
df_W1 = df_W1[~df_W1.index.duplicated(keep='first')]

### reset index inplace

In [ ]:
df_W_AU_UserID.reset_index(inplace=True)

### groupby to get count
https://stackoverflow.com/questions/19384532/get-statistics-for-each-group-such-as-count-mean-etc-using-pandas-groupby

In [ ]:
df.groupby(['col1','col2']).size()

df.groupby(['col1', 'col2']).size().reset_index(name='counts')

df.groupby(['col1', 'col2'])
    .agg({
    'col3': ['mean', 'count'], 
    'col4': ['median', 'min', 'count']
   }))

# Bag of Tricks (Advanced)

### change data type to object

In [ ]:
test['maxUE_UL+DL']=test['maxUE_UL+DL'].astype('object')

### extract importance for one hot encoding

In [ ]:
onehot_columns=rf_clf_1.named_steps['prep'].transformer_list[1][1][3].get_feature_names(input_features=remain_cat_features)
numeric_features_list = list(remain_num_features)
numeric_features_list.extend(onehot_columns)

importances = list(zip(zip(rf_clf_1.named_steps['rf'].feature_importances_, numeric_features_list)))
importances.sort(reverse=True)

std = np.std([
    tree.feature_importances_ for tree in rf_clf_1.steps[2][1].estimators_], axis=0)

from sklearn.inspection import permutation_importance
forest_importances = pd.Series(importances, index=feature_names)

#### Rolling Averages

In [ ]:
#percentage change of variable with period of 3
#https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html
df.pct_change(periods=3)

In [2]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.core.window.rolling.Rolling.mean.html
# dataseries rolling average
s.rolling(3).mean()

In [ ]:
#convert object to date time
df[["col1", "col2", "col3"]].apply(pd.to_datetime)

#### set figure size in pyplot

In [ ]:
fig = plt.figure(figsize = (12,4))